# ------------------------------------------
# Configuration is not required (19.04.2024)
# ------------------------------------------

# Auth Tokens
TELEGRAM_API_TOKEN = ""
SITE_API_TOKEN = ""

# Server Database (MySQL)
host = "46.188.100.158"
port = 3306
user = "sigma"
password = "j$sdjk!53"
db = "main_db"
charset = 'utf8'

# Categories
categories = ['Мясная гастрономия', 'Сладости и десерты', 'Сыры', 'Овощи и фрукты', 'Кулинария', 'Выпечка и хлеб',
              'Напитки', 'Замороженные полуфабрикаты', 'Товары для животных', 'Алкоголь', 'Косметика средства гигиены',
              'Молочные продукты', 'Мясо птица', 'Рыба и морепродукты', 'Детское питание', 'Техника', 'Ремонт',
              'Товары для дома', 'Авто', 'Канцтовары', 'Красота и здоровье', 'Досуг и хобби', 'Игрушки', 'Мебель',
              'Детская одежда и обувь', 'Хозтовары', 'Зоотовары', 'Детям и мамам', 'Книги', 'Дача и сад', 'Бакалея',
              'Колбаса и сосиски']
