# ------------------------------------------
# Configuration is not required (23.02.2024)
# ------------------------------------------


# Telegram Bot API TOKEN
TELEGRAM_API_TOKEN = "6704180049:AAF5IqOjQUuHG4WwzQmxB8-0s1367xL8i1w"

# Server Database (MySQL)
HOST = '46.188.100.158'
PORT = 3306
PORT_API = 3214
USER = 'sigma'
PASSWORD = 'j$sdjk!53'
DB = 'main_db'
CHARSET = "utf8"

# BCRYPT
encoding = 'utf-8'

# NEWS POLLING
time_out = 60

# Categories
CATEGORIES = [
    'Мясная гастрономия', 'Сладости и десерты', 'Сыры', 'Овощи и фрукты', 'Кулинария', 'Выпечка и хлеб',
    'Напитки', 'Замороженные полуфабрикаты', 'Товары для животных', 'Алкоголь', 'Косметика средства гигиены',
    'Молочные продукты', 'Мясо птица', 'Рыба и морепродукты', 'Детское питание', 'Техника', 'Ремонт',
    'Товары для дома', 'Авто', 'Канцтовары', 'Красота и здоровье', 'Досуг и хобби', 'Игрушки', 'Мебель',
    'Детская одежда и обувь', 'Хозтовары', 'Зоотовары', 'Детям и мамам', 'Книги', 'Дача и сад', 'Бакалея',
    'Колбаса и сосиски'
]

